from fastapi import FastAPI, HTTPException, status
from fastapi.responses import StreamingResponse, Response, HTMLResponse
import cv2
import io

solar_system = FastAPI()


@solar_system.get("/")
def root():
    return {"هدف": "شناخت منظومه‌ شمسی؛ شکل‌گیری، سیاره‌ها، عجایب و هر آنچه باید بدانید",
            "توضیح مختصر": 
                          "  منظومه‌ی شمسی یکی از میلیاردها منظومه‌ی ستاره‌ای در کهکشان راه شیری محسوب می‌شود که از ستاره‌ی مرکزی متوسط خورشید تشکیل شده است. "
                          "  ترتیب قرارگیری سیاره‌ها در این منظومه از نزدیک‌ترین جرم به خورشید عبارت‌اند از: عطارد، زهره، زمین، مریخ، مشتری، زحل، اورانوس، نپتون و احتمالاً سیاره نهم."
                          " منظومه‌ی شمسی از خورشید آغاز شده و تا کمربند کویپر ادامه پیدا می‌کند و در نهایت به مرز هلیوپاس می‌رسد. "
                          " بر اساس تخمین دانشمندان، لبه‌ی منظومه‌ی شمسی تقریباً ۱۵ میلیارد کیلومتر از خورشید فاصله دارد."
                          " در آن سوی هلیوپاس هم ابری بیضی شکل و عظیم موسوم به ابر اورت قرار دارد که منظومه‌ی شمسی ما را احاطه کرده است."
            }


@solar_system.get("/solarsystem")
def solarsystem():
    return {
        "منظومه شمسی چیست؟": 
                            " منظومه‌ی شمسی به مجموعه‌ای از سیاره‌ها، قمرها، سیارک‌ها، دنباله‌دارها و گاز و غباری گفته می‌شود که حول محور ستاره‌ی خورشید می‌چرخند. "
                            " این منظومه از سیاره‌های سنگی شامل عطارد، زهره، زمین و مریخ، غول‌های گازی شامل مشتری و زحل و غول‌های یخی شامل اورانوس و نپتون تشکیل شده است. "
                            "بین مریخ و مشتری مجموعه‌ای از سیارک‌ها موسوم به کمربند سیارکی قرار دارند و در آن سوی نپتون هم مجموعه‌ای از اجرام یخی کوچک موسوم به کمربند کویپر به دور خورشید می‌چرخند. "
                            "اجرامی مثل سیاره کوتوله پلوتو نیز جزو کمربند کویپر محسوب می‌شوند. "
        }


@solar_system.get("/image/{item}")
def solarsystem2(item: int):
    if item == 0:
        image2 = cv2.imread("assets/sun.png")
        _, encode_image = cv2.imencode(".png", image2)
        return StreamingResponse(content=io.BytesIO(encode_image.tobytes()), media_type = "image/png")
    elif item==1:
        image3 = cv2.imread("assets/mercury.png")
        _, encode_image2 = cv2.imencode(".png", image3)
        return StreamingResponse(content=io.BytesIO(encode_image2.tobytes()), media_type = "image/png")
    elif item==2:
        image4 = cv2.imread("assets/zohre.png")
        _, encode_image3 = cv2.imencode(".png", image4)
        return StreamingResponse(content=io.BytesIO(encode_image3.tobytes()), media_type = "image/png")
    elif item==3:
        image5 = cv2.imread("assets/earth.png")
        _, encode_image4 = cv2.imencode(".png", image5)
        return StreamingResponse(content=io.BytesIO(encode_image4.tobytes()), media_type = "image/png")
    elif item==4:
        image6 = cv2.imread("assets/mars.png")
        _, encode_image5 = cv2.imencode(".png", image6)
        return StreamingResponse(content=io.BytesIO(encode_image5.tobytes()), media_type = "image/png")
    elif item==5:
        image7 = cv2.imread("assets/jupyter.png")
        _, encode_image6 = cv2.imencode(".png", image7)
        return StreamingResponse(content=io.BytesIO(encode_image6.tobytes()), media_type = "image/png")
    elif item==6:
        image8 = cv2.imread("assets/zohal.png")
        _, encode_image7 = cv2.imencode(".png", image8)
        return StreamingResponse(content=io.BytesIO(encode_image7.tobytes()), media_type = "image/png")
    elif item==7:
        image9 = cv2.imread("assets/uranus.png")
        _, encode_image9 = cv2.imencode(".png", image9)
        return StreamingResponse(content=io.BytesIO(encode_image9.tobytes()), media_type = "image/png")
    elif item==8:
        image10 = cv2.imread("assets/poloto.png")
        _, encode_image10 = cv2.imencode(".png", image10)
        return StreamingResponse(content=io.BytesIO(encode_image10.tobytes()), media_type = "image/png")
    elif item==9:
        image11 = cv2.imread("assets/all.png")
        _, encode_image11 = cv2.imencode(".png", image11)
        return StreamingResponse(content=io.BytesIO(encode_image11.tobytes()), media_type = "image/png")
    else:
        raise HTTPException(status_code=status.HTTP_400_BAD_REQUEST, detail="your number must be between 0 and 9")
    

@solar_system.get("/origin")
def solarsystem3():
    result = {
        "نحوه ی پیدایش منظومه شمسی ":                      
                                    [{'پاراگرف اول':
                                                    'نزدیک به ۴٫۶ میلیارد سال پیش، ابری تاریک از گاز و غبار دچار فروریزش گرانشی شد. این ابر فشرده و به دیسکی چرخان موسوم به سحابی خورشیدی تبدیل شد. گرما و فشار در نهایت به قدری زیاد بود که اتم‌های هیدروژن با یکدیگر ترکیب شدند و هلیوم را تشکیل دادند. برهم‌کنش‌های هسته‌ای مقادیر زیادی انرژی آزاد کردند و خورشید شکل گرفت.',
                                    'پاراگراف دوم':
                                                    'خورشید تقریبا ۹۹ درصد از مواد موجود در سحابی خورشید را جمع کرد و باقی‌مانده‌ی مواد توده‌های مشابهی را داخل دیسک چرخان شکل دادند. برخی از این مواد به جرم کافی و گرانش رسیدند و به توده‌های کروی یا سیاره‌ها، سیاره‌های کوتوله و قمرها تبدیل شدند. دیگر قطعات باقی‌مانده شهاب‌سنگ‌ها، دنباله‌دارها و دیگر قمرهای تشکیل‌دهنده‌ی منظومه‌ی شمسی را شکل دادند.',
                                    'پاراگراف سوم':
                                                    'شهاب‌سنگ‌ها یا سنگ‌های آسمانی که روی زمین سقوط کردند به دانشمندان در تخمین سن منظومه‌ی شمسی کمک کردند. برخی از این قطعات کوچک از قمرها یا سیاره‌هایی سرچشمه گرفتند که می‌توانند اطلاعات علمی جذابی را درباره‌ی ويژگی‌های شیمیایی و تاریخچه‌ی جرم والد خود بدهند. برخی دیگر هم از همان ابتدا و پیش از شکل‌گیری سیاره‌ها در منظومه‌‌ی شمسی گردش می‌کردند. شهاب‌سنگ آلنده که در سال ۱۹۶۹ روی زمین سقوط کرد شناخته‌شده‌ترین شهاب‌سنگ با قدمت ۴٫۵۵ میلیارد سال است.',
                                    'پاراگراف چهارم':
                                                    'به عقیده‌ی دانشمندان، منظومه‌ی شمسی در زمان انفجار ستاره‌ی مجاور یا فرایند ابرنواختر به وجود آمد. بر اساس این نظریه انفجار باعث ارسال موج‌های ضربه‌ای به داخل فضا شد و این موج‌ها سحابی خورشیدی را به یکدیگر فشرده کردند و در نهایت به فروریزش آن انجامیدند. ابرنواختر احتمالاً مواد را به داخل سحابی هدایت کرد.',                 
                                                    }],
            }
    return result


@solar_system.get("/planet")
def solarsystem4():
    result = {
        "سیاره های منظومه شمسی ":                      
                                    [{'پاراگرف اول':
                                                    'چهار سیاره‌ی درونی منظومه‌ی شمسی یعنی عطارد، زهره، زمین و مریخ، به‌دلیل داشتن سطح سنگی در گروه سیاره‌های زمین‌سان یا جهان‌های سنگی دسته‌بندی می‌شوند.',
                                    'پاراگراف دوم':
                                                    'چهار دنیای بیرونی منظومه‌ی شمسی یعنی مشتری، زحل، اورانوس و نپتون به دلیل اندازه‌ی بزرگ‌تر نسبت به سیاره‌های سنگی، سیاره‌های مشتری‌سان نامیده می‌شوند. بخش زیادی از این سیاره‌ها را گازهایی مثل هیدروژن و هلیوم تشکیل می‌دهند، گرچه به عقیده‌ی برخی سیاره‌شناس‌ها برخی از این سیاره‌ها هسته‌هایی جامد دارند.',
                                    'پاراگراف سوم':
                                                    'سیاره‌های مشتری و زحل غول گازی نامیده می‌شوند، در حالی که اورانوس و نپتون، دو دنیای دورتر منظومه‌‌ی شمسی در گروه غول‌های یخی دسته‌بندی می‌شوند، زیرا از عناصری سنگین‌تر از هیدروژن و هلیوم، مانند اکسیژن، کربن، نیتروژن و گوگرد تشکیل شده‌اند و گوشته‌ای ضخیم از متان، آمونیاک و آب یخ‌زده دارند.',
                                                    }],
        "تعریف سیاره":" بر اساس تعریف استاندارد، سیاره‌ جرمی با ابعاد کافی است که به دور خورشید و خود می‌چرخد. اما آنقدر بزرگ نیست که مانند ستاره عمل همجوشی هسته‌ای را انجام دهد. همچنین مجاورت خود را از تعداد زیادی از اجرام دیگر پاکسازی کرده است."
            }
    return result


@solar_system.get("/planet/{item}")
def solarsystem5(item: str):
    if item == "mercury":
        result = {
            "مشخصات سیاره عطارد":                      
                                        [{'کشف':
                                                        'برای یونانیان باستان شناخته شده بود و با چشم غیرمسلح در آسمان دیده می‌شود.',
                                        'نام‌گذاری':
                                                        'مرکوری، برگرفته از نام خدای پیام‌رسان در اساطیر رومی',
                                        'قطر':
                                                        '۴۸۷۸ کیلومتر',
                                        'سال':
                                                        '۸۸ روز زمینی',
                                        'روز':
                                                        '۵۸/۶ روز زمینی',
                                        'تعداد قمرها':
                                                        'صفر',
                                                        
                                                        }],
            "توضیحات بیشتر":[{"پاراگراف اول":" سیاره عطارد نزدیک‌ترین جهان به خورشید و کوچک‌ترین سیاره در منظومه شمسی است. این سیاره فقط اندکی از ماه زمین بزرگ‌تر است و درطول ۸۸ روز مدار خود به دور خورشید را کامل می‌کند.",
                    "پاراگراف دوم":"اختلاف دمای روز و شب عطارد چشمگیر است. دمای عطارد در طول روز به ۴۵۰ درجه‌ی سانتی‌گراد می‌رسد که برای ذوب سرب کفایت می‌کند. در طول شب دما تا منفی ۱۸۰ درجه‌ی سانتی‌گراد کاهش می‌یابد. جو عطارد بسیار نازک است و عناصری مثل اکسیژن، سدیم، هیدروژن، هلیوم و پتاسیم را دربردارد. از آنجا که این جو ضعیف نمی‌تواند از برخورد شهاب‌سنگ‌ها جلوگیری کند، سطح عطارد هم مانند ماه زمین مملؤ از دهانه‌های برخوردی است.",
                    "پاراگراف سوم":" کاوشگر مسنجر ناسا در جریان مأموریتی پنج ساله، یافته‌های جالبی را درباره‌ی عطارد به دست آورد که انتظارات ستاره‌شناسان را به چالش کشید. یکی از این یافته‌ها کشف یخ‌آب و ترکیب‌های زیستی منجمد در قطب شمال عطارد و همچنین نقش چشمگیر فعالیت‌های آتشفشانی در شکل‌گیری سطح این سیاره بود."}]
                }
        return result
    elif item == "venus":
        result = {
            "مشخصات سیاره زهره":                      
                                        [{'کشف':
                                                        'برای یونانیان باستان شناخته شده بود و با چشم غیرمسلح در آسمان دیده می‌شود.',
                                        'نام‌گذاری':
                                                        'ونوس، برگرفته از نام خدای عشق و زیبایی در اساطیر رومی',
                                        'قطر':
                                                        '۱۲۱۰۴ کیلومتر',
                                        'سال':
                                                        '۲۲۵ روز زمینی',
                                        'روز':
                                                        '۲۴۱ روز زمینی',
                                        'تعداد قمرها':
                                                        'صفر',
                                                        
                                                        }],
            "توضیحات بیشتر":[{"پاراگراف اول":" سیاره ناهید یا زهره، دومین جهان از نظر فاصله با خورشید و داغ‌ترین سیاره‌ی منظومه‌ی شمسی است. جو ضخیم زهره از ترکیب‌هایی مثل ابرهای سولفوریک اسید تشکیل شده است. زهره را می‌توان یکی از نمونه‌های بارز پیامد اثر گلخانه‌ای در نظر گرفت.",
                    "پاراگراف دوم":"دمای میانگین سطح زهره به ۴۶۵ درجه‌ی سانتی‌گراد می‌رسد و فشار سطحی آن ۹۲ بار (۹۲۰۰ کیلوپاسکال) است که می‌تواند انسان را متلاشی کند. عجیب‌تر از هر چیز، زهره گردش کندی به دور خود دارد و خلاف جهت سیاره‌های دیگر یعنی از شرق به غرب به دور خود می‌چرخد.",
                    "پاراگراف سوم":" گاهی اوقات زهره را دوقلوی زمین می‌نامند زیرا این سیاره از نظر اندازه به زمین نزدیک است و بر اساس تصاویر راداری، کوهستان‌ها و آتشفشان‌های متعددی دارد. اما در حقیقت زمین و زهره تفاوت‌های بسیار زیادی با یکدیگر دارند.",
                    "پاراگراف چهارم":" از آنجا که زهره پس از ماه درخشان‌ترین جرم در آسمان شب است،‌ یونانیان تصور می‌کردند دو جرم متفاوت است؛ هسپروس به عنوان ستاره‌ای که در شب مشاهده می‌شود و ائوسفروس به عنوان ستاره‌ای صبحگاهی. همین درخشش بسیار زیاد، باعث می‌شود که ناهید گاهی اوقات با یوفو اشتباه گرفته شود."}]
                }
        return result
    elif item == "earth":
        result = {
            "مشخصات سیاره زمین":                      
                                        [{
                                        'نام‌گذاری':
                                                        'Earth برگرفته از کلمه‌ی آلمانی «Die Erde» به معنی زمین.',
                                        'قطر':
                                                        '۱۲۷۶۰ کیلومتر',
                                        'سال':
                                                        '۳۶۵ روز زمینی',
                                        'روز':
                                                        'هر یک روز ۲۳ ساعت و ۵۶ دقیقه',
                                        'تعداد قمرها':
                                                        'یک',
                                                        
                                                        }],
            "توضیحات بیشتر":
                        [{
                            "پاراگراف اول":" زمین، خانه‌ی ما سومین سیاره از نظر فاصله تا خورشید است. زمین دنیایی آبی است به طوری که دو سوم از آن با آب پوشیده شده است. جو زمین غنی از نیتروژن و اکسیژن است و از این رو تنها جهان مناسب حیاتی است که می‌شناسیم.",
                            "پاراگراف دوم":"زمین با سرعت ۴۶۷ متر بر ثانیه به دور خود می‌چرخد. اما این سرعت در استوا اندکی بیشتر است. سرعت چرخش زمین به دور خورشید به ۲۹ کیلومتر بر ثانیه می‌رسد. زمین همچنین بزرگ‌ترین سیاره‌ی سنگی منظومه‌ی شمسی است و یک قمر دارد. به عقیده‌ی دانشمندان، جرمی در اوایل شکل‌گیری زمین به آن برخورد کرده و قطعه‌ای از آن به داخل آسمان پرتاب شد و به این ترتیب ماه تشکیل شد.",
                        }]
                }
        return result
    elif item == "mars":
        result = {
            "مشخصات سیاره مریخ":                      
                                        [{'کشف':
                                                        'برای یونانیان باستان شناخته شده بود و با چشم غیرمسلح در آسمان دیده می‌شود.',
                                        'نام‌گذاری':
                                                        ' مارس، برگرفته از نام خدای جنگ در اساطیر رومی',
                                        'قطر':
                                                        '۶۷۸۷ کیلومتر',
                                        'سال':
                                                        '۶۸۷ روز زمینی',
                                        'روز':
                                                        'هر یک روز ۲۴ ساعت و ۳۷ دقیقه',
                                        'تعداد قمرها':
                                                        'دو',
                                                        
                                                        }],
            "توضیحات بیشتر":[{"پاراگراف اول":" سیاره مریخ چهارمین سیاره از نظر فاصله با خورشید است. این سیاره‌ی بیابان‌مانند و سرد با غبار آهن اکسید پوشیده شده و به همین دلیل به رنگ قرمز دیده می‌شود. مریخ شباهت‌هایی با زمین دارد. در درجه‌ی اول مانند زمین سنگی است، کوهستان‌ها و دره‌هایی دارد و همچنین سیستم طوفانی آن مانند زمین شامل تنوره‌دیو‌های کوچک گردباد مانند تا طوفان‌های گردوغبار است که کل سیاره را می‌پوشانند.",
                    "پاراگراف دوم":"شواهد علمی نشان می‌دهند مریخ در حدود میلیاردها سال پیش دنیایی گرم‌تر و مرطوب‌تر بوده و احتمالاً رودخانه‌ها و شاید اقیانوس‌هایی در آن جریان داشتند. گرچه جو مریخ برای جریان‌داشتن آب مایع سطحی به شدت رقیق است، بقایای مریخ مرطوب‌تر امروزه وجود دارند. صفحات یخی مریخی هم‌اندازه با ایالت کالیفرنیا زیر سطح مریخ قرار دارند و از طرفی هر دو قطب مریخ دارای پوشش‌های یخی آب هستند.",
                    "پاراگراف سوم":" به باور دانشمندان مریخ باستانی از شرایط لازم برای پشتیبانی از حیات مثل باکتری‌ها و دیگر میکروب‌ها برخوردار بوده است. آن‌ها امیدوارند علائم این حیات گذشته و احتمالاً شکل‌های حیات کنونی را پیدا کنند. این فرضیه زمینه‌ساز پرتاب مأموریت‌های متعددی به مریخ شد؛ به‌طوری‌که امروزه سیاره سرخ یکی از آشناترین و پراکتشاف‌ترین اجرام منظومه‌ی شمسی است.",
                    }]
                }
        return result
    elif item == "jupiter":
        result = {
            "مشخصات سیاره مشتری":                      
                                        [{'کشف':
                                                        'برای یونانیان باستان شناخته شده بود و با چشم غیرمسلح در آسمان دیده می‌شود.',
                                        'نام‌گذاری':
                                                        ' ژوپیتر برگرفته از نام خدای جنگ در اساطیر رومی',
                                        'قطر':
                                                        '۱۳۹۸۲۲ کیلومتر',
                                        'سال':
                                                        '۱۱/۹ سال زمینی',
                                        'روز':
                                                        'هر یک روز ۹ ساعت و ۴۸ دقیقه',
                                        'تعداد قمرها':
                                                        '۹۵',
                                                        
                                                        }],
            "توضیحات بیشتر":[{"پاراگراف اول":" سیاره مشتری پنجمین سیاره از نظر فاصله تا خورشید و بزرگ‌ترین سیاره‌ی منظومه‌ی شمسی است. این غول گازی جرمی دو برابر کل سیاره‌های دیگر منظومه‌ی شمسی دارد.",
                        "پاراگراف دوم":"ابرهای چرخان مشتری به خاطر ترکیب انواع مواد مثل آمونیاک یخی، کریستال‌های آمونیوم هیدروسولفید و یخ‌آب و بخار، رنگارنگ هستند. یکی از شاخصه‌های معروف مشتری در ابرهای چرخان آن، لکه‌ی سرخ بزرگ است که بیش از ۱۶ هزار کیلومتر قطر دارد و آن‌قدر بزرگ است که می‌تواند تقریباً سه زمین را ببلعد.",
                        "پاراگراف سوم":" سیاره‌ی مشتری همچنین دارای قوی‌ترین میدان مغناطیسی و ۹۵ قمر است که از معروف‌ترین آن‌ها می‌توان به گانیمید، آیو، کالیستو و اروپا اشاره کرد که با عنوان قمرهای گالیله هم شناخته می‌شوند.",
                        }]
                }
        return result
    elif item == "saturn":
        result = {
            "مشخصات سیاره زحل":                      
                                        [{'کشف':
                                                        'برای یونانیان باستان شناخته شده بود و با چشم غیرمسلح در آسمان دیده می‌شود.',
                                        'نام‌گذاری':
                                                        ' ساترن برگرفته از نام خدای جنگ در اساطیر رومی',
                                        'قطر':
                                                        '۱۲۰۵۰۰ کیلومتر',
                                        'سال':
                                                        '۲۹/۵ سال زمینی',
                                        'روز':
                                                        'هر یک روز ۱۰ ساعت و ۳۰ دقیقه',
                                        'تعداد قمرها':
                                                        '۱۴۵',
                                                        
                                                        }],
            "توضیحات بیشتر":[{"پاراگراف اول":" سیاره زحل ششمین سیاره از نظر فاصله با خورشید به خاطر سیستم حلقه‌ی عظیم و درخشانش معروف است. گرچه زحل تنها سیاره‌ی حلقه‌دار منظومه‌ی شمسی نیست. وقتی گالیله برای اولین بار در اوایل سده‌ی ۱۶۰۰ میلادی به بررسی زحل پرداخت، تصور می‌کرد این سیاره جرمی با سه بخش است: یک سیاره و دو قمر بزرگ در دو سمت. او نمی‌دانست در حال دیدن سیاره‌ای حلقه‌دار است. بیش از ۴۰ سال بعد کریستین هویگنس وجود حلقه‌های زحل را ثابت کرد.",
                        "پاراگراف دوم":"زحل هم مانند سیاره‌ی مشتری، غولی گازی و کم‌چگالی‌ترین سیاره‌ی منظومه‌ی شمسی است. این سیاره همچنین دارای تعداد زیادی قمر است که بر اساس آخرین آمار تعداد آن‌ها به ۱۴۵ عدد می‌رسد. با این تعداد قمر، زحل پادشاه قمرهای منظومه شمسی محسوب می‌شود. انسلادوس، یکی از قمرهای زحل پوشیده از اقیانوسی یخی است که به گفته‌ی ستاره‌شناسان می‌تواند هدف امیدبخشی برای حیات فرازمینی باشد.",
                        "پاراگراف سوم":" حلقه‌های زحل عمدتاً از یخ و سنگ تشکیل شده‌اند و دانشمندان هنوز درباره‌ی چگونگی شکل‌گیری آن‌ها اطمینان ندارند.",
                        }]
                }
        return result
    elif item == "uranus":
        result = {
            "مشخصات سیاره اورانوس":                      
                                        [{'کشف':
                                                        'سال ۱۷۸۱ توسط ویلیام هرشل‌ (قبل از این تاریخ مردم تصور می‌کردند اورانوس یک ستاره است).',
                                        'نام‌گذاری':
                                                        ' مظهر بهشت و نام یکی از خدایان در اساطیر یونانی',
                                        'قطر':
                                                        '۵۱۱۲۰ کیلومتر',
                                        'سال':
                                                        '۸۴ سال زمینی',
                                        'روز':
                                                        'هر یک روز ۱۸ ساعت ',
                                        'تعداد قمرها':
                                                        '۲۷',
                                                        
                                                        }],
            "توضیحات بیشتر":[{"پاراگراف اول":" سیاره اورانوس، هفتمین سیاره از نظر فاصله با خورشید است که ویژگی‌های عجیب و منحصر‌به فردی دارد. ابرهای اورانوس از هیدروژن سولفید تشکیل شده‌اند که همان ماده‌ی شیمیایی عامل فاسد شدن تخم مرغ و بوی بد آن است. در درجه‌ی دوم اورانوس مانند زهره از شرق به غرب به دور خود می‌چرخد اما برخلاف زهره یا هر سیاره‌ی دیگری استوای آن عمود بر مدارش است و می‌توان گفت به پهلو می‌چرخد.",
                        "پاراگراف دوم":"به عقیده‌ی ستاره‌شناس‌ها، جرمی دو برابر زمین در حدود ۴ میلیارد سال پیش با اورانوس برخورد کرده و انحراف محوری شدید اورانوس را به وجود آورده است. این انحراف به فصل‌هایی کرانی با طول مدت حداقل ۲۰ سال می‌انجامد، به طوری که نور خورشید به مدت ۸۴ سال به یک قطب اورانوس می‌تابد.حل هم مانند سیاره‌ی مشتری، غولی گازی و کم‌چگالی‌ترین سیاره‌ی منظومه‌ی شمسی است. این سیاره همچنین دارای تعداد زیادی قمر است که بر اساس آخرین آمار تعداد آن‌ها به ۱۴۵ عدد می‌رسد. با این تعداد قمر، زحل پادشاه قمرهای منظومه شمسی محسوب می‌شود. انسلادوس، یکی از قمرهای زحل پوشیده از اقیانوسی یخی است که به گفته‌ی ستاره‌شناسان می‌تواند هدف امیدبخشی برای حیات فرازمینی باشد.",
                        "پاراگراف سوم":" به نظر می‌رسد برخورد یادشده مقداری از سنگ و یخ اورانوس را به مدارش منتقل کرده و این سنگ و یخ‌ها بعدها قمرهای اورانوس را تشکیل دادند. متان موجود در جو اورانوس عامل اصلی رنگ سبزآبی آن است. اورانوس ۱۳ مجموعه حلقه دارد.",
                        "پاراگراف چهارم":" سیاره‌ی اورانوس همچنین رکورد سردترین دمای ثبت شده در منظومه‌ی شمسی یعنی منفی ۲۲۴٫۲ درجه‌ی سانتی‌گراد را از آن خود کرده است. دمای میانگین اورانوس به منفی ۱۹۵ درجه‌ی سانتی‌گراد می‌رسد.",
                        }]
                }
        return result
    elif item == "neptune":
        result = {
            "مشخصات سیاره نپتون":                      
                                        [{'کشف':
                                                        '۱۸۴۶',
                                        'نام‌گذاری':
                                                        ' نپتون، برگرفته از نام خدای آب و دریا در اساطیر رومی',
                                        'قطر':
                                                        '۴۹۵۳۰ کیلومتر',
                                        'سال':
                                                        '۱۶۵ سال زمینی',
                                        'روز':
                                                        'هر یک روز ۱۹ ساعت ',
                                        'تعداد قمرها':
                                                        '۱۴',
                                                        
                                                        }],
            "توضیحات بیشتر":[{"پاراگراف اول":" سیاره نپتون هشتمین و دورترین سیاره از خورشید است. دمای میانگین نپتون در قسمت ابرهای فوقانی به منفی ۲۱۰ درجه‌ی سانتی‌گراد می‌رسد. این سیاره‌ تقریبا هم‌اندازه با اورانوس است و به خاطر بادهای قوی مافوق‌صوت شهرت دارد.",
                        "پاراگراف دوم":"نپتون اولین سیاره‌ای بود که با استفاده از ریاضیات کشف شد. یوهان گاله، ستاره‌شناس آلمانی از محاسبات ریاضی برای یافتن نپتون با تلسکوپ استفاده کرد.",
                        "پاراگراف سوم":" نپتون تقریبا ۱۷ برابر سنگین‌تر از زمین است و هسته‌ای سنگی دارد. ترکیب اصلی نپتون، آب، متان و آمونیاک است که این هسته‌ی سنگی را احاطه کرده‌اند. سرعت بادهای نپتون به ۲۰۰۰ کیلومتر بر ساعت می‌رسد. این سیاره همچنین ۱۴ قمر دارد.",
                        }]
                }
        return result
    elif item == "pluto":
        result = {
            "کمربند سیارکی":
            "کمربند سیارکی بین مریخ و مشتری قرار دارد. بر اساس تخمین‌های ناسا، بین ۱٫۱ تا ۱٫۹ میلیون سیارک در کمربند اصلی سیارکی با قطر بیش از یک کیلومتر قرار دارند. سیاره‌ی کوتوله‌ی سرس با قطر تقریبی ۹۵۰ کیلومتر در این بخش از منظومه‌ی شمسی قرار دارد. تعدادی از سیارک‌ها دارای مدارهایی هستند که گاهی با زمین و دیگر سیاره‌های داخلی برخورد می‌کنند.",
            "کمربند کویپر":
            [{"پاراگراف اول":"ستاره‌شناس‌ها مدت‌ها به وجود نواری از مواد یخی موسوم به کمربند کویپر شک داشتند که در فراسوی مدار نپتون در فاصله‌ی ۳۰ تا ۵۵ برابر فاصله‌ی زمین تا خورشید قرار دارد. از قرن بیستم تاکنون بیش از هزار جرم در این کمربند کشف شده‌اند. بر اساس تخمین دانشمندان، کمربند کویپر احتمالا میزبان صدها هزار جرم یخی بزرگ‌تر از ۱۰۰ کیلومتر و همچنین تقریبا یک تریلیون دنباله‌دار است.",
            "پاراگراف دوم":"پلوتو که امروزه در گروه سیاره‌های کوتوله قرار می‌گیرد در کمربند کویپر قرار دارد. البته پلوتو تنها نیست و ماکی‌ماکی، هائومیا، اریس و کواوار از دیگر اجرام شناخته‌شده‌ی فرانپتونی از گروه سیاره‌های کوتوله محسوب می‌شوند. آراکوت (آلتیما تولی) نیز یک سیارک دوتایی واقع در کمربند کویپر است که کاوشگر نیوهورایزنز در سال ۲۰۱۹ با آن بازدید کرد."}],
            "مشخصات سیاره پلوتو":                      
                                        [{'کشف':
                                                        'کشف در سال ۱۹۳۰ توسط کلاید تامبا',
                                        'نام‌گذاری':
                                                        ' پلوتو یا پلوتون برگرفته از نام خدای جهان زیرین در اساطیر رومی',
                                        'قطر':
                                                        '۲۳۰۱ کیلومتر',
                                        'سال':
                                                        '۲۴۸ سال زمینی',
                                        'روز':
                                                        '۶/۴ روز زمینی',
                                        'تعداد قمرها':
                                                        '۵',
                                                        
                                                        }],
            "توضیحات بیشتر":[{"پاراگراف اول":" سیاره کوتوله پلوتو زمانی سیاره نهم درنظر گرفته می‌شد، اما از سال ۲۰۰۶ در گروه سیاره‌های کوتوله دسته‌بندی شد. دلیل این مسئله عدم تطبیق با معیارهای موجود در تعریف سیاره بود. بر اساس تعریف اتحادیه‌ی بین‌المللی نجوم، سیاره به جرمی آسمانی گفته می‌شود که در درجه‌ی اول در مدار خورشید قرار دارد، در درجه‌ی دوم از گرانش کافی برای تبدیل شدن به جرمی کروی یا تقریبا کروی برخوردار است و در درجه‌ی سوم مجاورت مدار خود را پاکسازی کرده باشد. پلوتو با معیار سوم منطق نبود و به همین دلیل از گروه سیاره‌ها خارج شد.",
                        "پاراگراف دوم":"پلوتو مداری به شدت بیضوی دارد، به گونه‌ای که حتی گاهی اوقات مدارش با مدار نپتون تداخل پیدا می‌کند. از سوی دیگر مدار پلوتو در صفحه‌ی یکسان با سیاره‌های دیگر ندارد بلکه در زاویه‌ی ۱۷٫۱ درجه بالاتر یا پائین‌تر از آن‌ها به دور خورشید می‌چرخد.",
                        "پاراگراف سوم":" به‌واسطه‌ی همین مدار عجیب، پلوتو از سال ۱۹۷۹ تا اوایل ۱۹۹۹ از نظر فاصله از خورشید، هشتمین سیاره منظومه‌ی شمسی محسوب می‌شد، اما در ۱۱ فوریه‌ی ۱۹۹۹ با عبور از مسیر نپتون دوباره به دورترین سیاره منظومه‌ی شمسی تبدیل شد تا اینکه در سال ۲۰۰۶ رسما از گروه سیاره‌ها خارج شد.",
                        "پاراگراف چهارم":"پلوتو که اندازه‌ای کوچک‌تر از قمر زمین دارد، دنیایی سنگی و سرد با جوی رقیق است. در ۱۴ ژوئیه ۲۰۱۵، کاوشگر نیوهورایزنز چند مانور پرواز از ارتفاع کم را در اطراف پلوتو انجام داد و چشم‌اندازی جدید از این سیاره کوتوله را به دنیای علم معرفی کرد که برخلاف بسیاری از انتظارات بود.",
                        "پاراگراف پنجم":"پلوتو در واقع دنیای یخی بسیار فعالی است که با یخچال‌ها، کوهستان‌های یخ‌آب، تپه‌های یخی و حتی احتمالا یخ‌فشان‌هایی پوشیده شده است که یخ‌های ساخته شده از آب، متان یا آمونیاک را به بیرون فوران می‌کنند.",
                        }]
                }
        return result
    elif item == "x":
        result = {
            "سیاره نهم":
            [{"پاراگراف اول":"پژوهشگرها در سال ۲۰۱۶، احتمال وجود سیاره‌ی نهم را مطرح کردند. این جسم که با عنوان سیاره‌ی X هم شناخته می‌شود، بر اساس تخمین‌ها ۱۰ برابر زمین جرم دارد و در فاصله‌ای بین ۳۰۰ تا ۱۰۰۰ برابر مسافت بین زمین و خورشید، به دور ستاره‌ی منظومه‌مان می‌چرخد. در واقع ممکن است سال این سیاره بین ۱۰ هزار تا ۲۰ هزار سال زمینی به طول بینجامد. دانشمندان تاکنون نتوانسته‌اند سیاره‌ی نهم را رصد کنند و وجود آن را بر اساس آثار گرانشی‌اش بر دیگر اجرام موجود در کمربند کویپر حدس زده‌اند.",
            "پاراگراف دوم":"بر اساس برخی فرضیه‌ها، سیاره فرضی نهم می‌تواند سیاهچاله‌ای آغازین باشد که در فاصله‌ی کوتاهی پس از بیگ‌بنگ شکل گرفته و منظومه‌ی شمسی آن را در دام خود گرفتار کرده است. برخلاف سیاه‌چاله‌هایی که حاصل فروپاشی ستاره‌های کلان جرم هستند، سیاه‌چاله‌های آغازین براثر آشفتگی‌های گرانشی در کمتر از یک ثانیه پس از بیگ‌بنگ تشکیل شدند و ممکن است بسیار کوچک باشند (با قطر پنج سانتی‌متر) و همین مسئله کشف آن‌ها را دشوار می‌سازد.",
            "پاراگراف سوم":"ستاره‌شناس‌ها هنوز به نتیجه‌ی شفافی در رابطه با سیاره‌ی نهم نرسیده‌اند. بر اساس بررسی تلسکوپ ACT در شیلی در سال ۲۰۲۲، هزاران منبع کاندیدا برای این سیاره وجود دارد، اما هیچ کدام هنوز تأیید نشده‌اند."
            }]
                }
        return result
    else:
        raise HTTPException(status_code=status.HTTP_400_BAD_REQUEST, 
                            detail="input must be one of the member of following list: [عطارد, زهره, زمین, مریخ, مشتری, زحل, اورانوس, نپتون, پلوتو, نهم]")

    